mainMoudle.factory('solutionDataService', function () {
    var solutionData = [
        {
            id: 1,
            name: '电力',
            data: {
                img: '/Sources/realImgs/solution/1dl.jpg',
                imgDesc: '随着城市的发展，对电力建设带来两个问题：一是电力需求持续增长，市中心用电密度高，需要较多深入市区的高压变电站，以减少线损，而变电站一般占地面积大；二是城区价格昂贵，环境要求严格，流动人群居多，为电力行业的安防带来很大的挑战。',
                workStatus: '随着城市的发展，对电力建设带来两个问题：一是电力需求持续增长，市中心用电密度高，需要较多深入市区的高压变电站，以减少线损，而变电站一般占地面积大；二是城区价格昂贵，环境要求严格，流动人群居多，为电力行业的安防带来很大的挑战。',
                workAttr: '郊区电站周界大，入侵者很容易藏匿。<br />' +
                          '市区的变电站，供电所人流、物流出入频繁，安全管理难度大。<br />' +
                          '变电站，供电所的出入口众多，各种设备繁多，产品众多，容易丢失。<br />' +
                          '电力行业设施分布广泛，难以统一控制，集中管控。<br />' +
                          '因偷盗者的入侵引发的安全生产事故，可能导致大面积的停电，给整个社会经济带来巨大损失。',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能：高压电网和警示标志给企图入侵者极大的心理威慑，降低犯罪实施的几率。<br />' +
                          '主动防护性强：入侵者企图跨越时遭受电击，起到很好的主动防护效果。<br />' +
                          '防范严密无死角：可以依据地形任意架设，没有死角，消除安全盲点。<br />' +
                          '误报率低：能有效防止小动物、树枝、恶劣天气等造成的误报。<br />' +
                          '使用、维护方便：可以适应各种安装环境。<br />' +
                          '整合联动：视频监控系统、周界报警系统、电子巡更系统、门禁系统、短信报警控制系统等有机的联动结合。<br />' +
                          '远程操作：超越地域界限，远程实现开关机布撤防及高低压转换等不同功能。',
                cases: '白林变电站<br />' +
                          '沪常高速变电站<br />' +
                          '江苏电力公司无锡份公司 <br />' +
                          'S26铜梁县35KV变电站<br />' +
                          '江苏电力公司连云港份公司<br />' +
                              '山西地方电力有限公司方山分公司 <br />' +
                              '华能新疆青河风电场周界报警项目  <br />' +
                              '江西彭泽县供电公司<br />' +
                              '天津市银河电力总公司<br />' +
                              '安徽电力公司阜阳分公司<br />' +
                              '湖北省电力公司襄阳分公司<br />' +
                              '徐州煤矿集团洗煤厂35千伏变电站   <br />' +
                              '华能新疆哈密巴里坤三塘湖风电场周界报警项目 <br />' +
                          '西梧州市苍梧县可再生资源工业园区220千伏广信变电站'
            },
        },
        {
            id: 2,
            name: '小区',
            data: {
                img: '/Sources/realImgs/solution/2xq.jpg',
                imgDesc: '随着国民经济的发展，人民的生活日益提高，一些住宅小区纷纷使用高技术的智能化手段，为小区的服务与管理提供快捷高效的超值服务与管理，为家庭提供安全舒适家居环境。',
                workStatus: '随着国民经济的发展，人民的生活日益提高，一些住宅小区纷纷使用高技术的智能化手段，为小区的服务与管理提供快捷高效的超值服务与管理，为家庭提供安全舒适家居环境。<br />' +
                              '小区安防系统建设中，所有的系统都需要一个集中的小区监控管理中心，传统的安防系统是采用电话线来传送报警信号，信号传输速度慢，运行费用高，而且功能单一，要实现周界防范功能就必须另外布线，重新安装新系统，并且协调能力差，系统运行、维护复杂，从而造成物业管理部门工作难度加大。因此采用电子围栏作为周界防范，可以给与小区最好和最安全的保护。',
                workAttr: '小区的周界大小不一,而且有良好的绿化，偷盗者很容易藏匿。<br />' +
                              '人流，物流出入频繁，安全管理难度大。<br />' +
                              '小区的物业素质有高低之分，无法保证安全守护的万无一失。<br />' +
                              '老小区建造的时间较久,涉及到许多历史问题。',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能：高压电网和警示标志给企图入侵者极大的心理威慑，降低犯罪实施的几率。<br />' +
                                          '主动防护性强：入侵者企图跨越时遭受电击，起到很好的主动防护效果。<br />' +
                                             ' 防范严密无死角：特殊地形可以专门定做围栏杆，实现架设没有死角，消除安全盲点。<br />' +
                                             ' 误报率低：能有效防止小动物、树枝、恶劣天气等造成的误报，适应监狱周界长、巡查不便的特别，可以大大减少保安人员的出警次数。<br />' +
                                              '整合联动：视频监控系统、周界报警系统、电子巡更系统、门禁系统、短信报警控制系统等有机的联动结合。<br />' +
                                          '远程操作：从围墙现场到指挥中心距离很长，可以实现远程控制，比如远程开、关机等。',
                cases: '南京旭日华庭<br />' +
                          '武汉中谷苑小区<br />' +
                          '四川眉山市电力苑 <br />' +
                          '成都银泰香樟林 <br />' +
                          '天津泰悦豪庭小区 <br />' +
                              '厦门中骏天誉<br />' +
                              '江苏爱涛.逸珍商务楼 <br />' +
                              '合肥市丽水家园小区<br />' +
                              '六安市万华佳苑小区  <br />' +
                             ' 湖北鄂州市金桥名邸<br />' +
                              '湖南长沙浏阳高峰天马花园<br />' +
                              '安徽芜湖柏庄•跨界住宅项目<br />' +
                              '江苏省常州市德禾豪景小区   <br />' +
                              '四川省双流综合发展项目售楼处 <br />' +
                              '安徽省合肥经济开发区芙蓉路泓泰苑  <br />' +
                              '上海万里真欣苑小区<br />' +
                              '上海兰花教师楼北区'
            },
        },
        {
            id: 3,
            name: '别墅',
            data: {
                img: '/Sources/realImgs/solution/3bs.jpg',
                imgDesc: '随着人们对生活舒适性要求的不断提高，别墅等高档住宅成为越来越多的有钱人和追求高尚居住人群的居家首选。别墅因其居所的相对独立，户主的生活和寓所的活动相对封闭，邻里间的空间距离比较远，因而别墅的安全问题显得尤为重要。',
                workStatus: '随着人们对生活舒适性要求的不断提高，别墅等高档住宅成为越来越多的有钱人和追求高尚居住人群的居家首选。别墅因其居所的相对独立，户主的生活和寓所的活动相对封闭，邻里间的空间距离比较远，因而别墅的安全问题显得尤为重要。虽然目前很多别墅群落在小区物业方面加强了对别墅小区安全防范的管理，大大提高了小区的安全防范等级，但仍不能避免一些盗窃事件及严重犯罪事件的偶有发生。',
                workAttr: '别墅周界大，绿化带多，入侵者很容易藏匿。<br />' +
                              '别墅的安防的同时对设备外观的要求也比较高。<br />' +
                              '周界监控设备造价高昂，不易大范围使用。<br />' +
                              '个人用户对安防设备的隐秘性要求较高',
                solution: '小区周界防范<br />' +
                          '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件<br/>' +
                          '个人家庭防范<br/>' +
                          '安防设备：振动光纤',
                advantage: '具有威慑功能 高压电网和警示标志给犯罪分子以极大的心里威慑作用，避免其实施犯罪行为<br />' +
                                              '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                              '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                              '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报.<br />' +
                                              '防护的同时做到美观 前端围栏可以根据业主的需求定做杆和绝缘子,也可以采用艺术型围栏,在起到安全防护的同时能又不影响美观.<br />' +
                                              '能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                              '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '合肥市和庄别墅<br />' +
                          '西安未央湖佳隆别墅<br />' +
                          '上海市崇明县庙镇高端私家别墅'
            },
        },
        {
            id: 4,
            name: '学校',
            data: {
                img: '/Sources/realImgs/solution/4xx.jpg',
                imgDesc: '目前，无论是普通高校还是中小学校，校园安防现状都不容乐观，基本上处在一个以人防和机防为主的状况中，技防仍然处在起步阶段。学校不断在人防和机防方面增加投入，如增加学校保安人员，由学生组织校卫队，加高围墙，在学生宿舍的窗户上安装钢筋护栏等。',
                workStatus: '目前，无论是普通高校还是中小学校，校园安防现状都不容乐观，基本上处在一个以人防和机防为主的状况中，技防仍然处在起步阶段。学校不断在人防和机防方面增加投入，如增加学校保安人员，由学生组织校卫队，加高围墙，在学生宿舍的窗户上安装钢筋护栏等。 这些措施产生了一定的效果，但也存在一些弊端，如校卫队会带来持续的支出，宿舍安装钢筋护栏不符合消防要求。<br />' +
                                              '校园安防主要由两部分区域组成：一是教学办公区，一是学生学习和生活的区域。目前，大部分的中小学学校都实行封闭式管理，但中小学学生的自控力相对较差，自我保护能力也较弱。所以，从环境来分析，校园安防具有监控点多、监控面积大的特点。',
                workAttr: '学校周界大，房屋多, 偷盗者很容易藏匿。<br />' +
                                              '中小学生自控能力相对较差,经常通过翻围墙偷跑出学校,<br />' +
                                              '周界监控设备造价高昂，不易大范围使用。',
                solution: '安防设备：<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给犯罪分子以极大的心里威慑作用，避免其实施犯罪行为,同时能避免学生企图通过翻越围栏跑到校外.<br />' +
                                              '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                              '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                              '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报.<br />' +
                                             ' 能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                              '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '浦航中学<br />' +
                          '南洋交大<br />' +
                          '壹号幼儿园<br />' +
                          '上海市天馨学校<br />' +
                          '合肥市稻香村小学<br />' +
                          '淮北市相山路中学<br />' +
                          '上海市友谊家园幼儿园  <br />' +
                          '中国科技大学西校区  <br />' +
                          '江苏省常州市潞城小学 <br />' +
                          '上海市杨泰三村幼儿园  <br />' +
                          '上海市海尚明城幼儿园 <br />' +
                          '上海闵行区银康幼儿园  <br />' +
                          '上海市闵行区富杰幼儿园 <br />' +
                          '上海浦江第三幼儿园浦润分园<br />' +
                          '安徽省合肥市方兴社区幼儿园  <br />' +
                          '贵州省铜仁市德江县青龙镇第四小学'
            },
        },
        {
            id: 5,
            name: '军事基地',
            data: {
                img: '/Sources/realImgs/solution/5jsjd.jpg',
                imgDesc: '军事基地是国家的武装力量，高度机密的机构，保密级别较高，它的安全防范工作极为重要，而传统采用的交流电网容易致人死亡，误伤事件时有发生，影响军地关系。因此，集阻挡、威慑、报警功能于一身具有可靠的安全性的电子围栏系统在军事基地具有非常强的适应性，应用极多。',
                workStatus: '军事基地是国家的武装力量，高度机密的机构，保密级别较高，它的安全防范工作极为重要，而传统采用的交流电网容易致人死亡，误伤事件时有发生，影响军地关系。因此，集阻挡、威慑、报警功能于一身具有可靠的安全性的电子围栏系统在军事基地具有非常强的适应性，应用极多。',
                workAttr: '军事基地周界大，入侵者很容易藏匿。<br />' +
                                              '军事基地皆为保密机关,一旦有人进入盗取资料,将造成不可估量的损失。<br />' +
                                              '传统红外报警方式，存在漏洞，易被入侵，经常误报，且设计理念落后，与人防难以有效结合。<br />' +
                                              '偷盗者的入侵，非常容易引发安全事故(如进入弹药库等)，不仅生命有危险,而且造成资源的浪费, 给国家带来巨大损失。',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给犯罪分子以极大的心里威慑作用，避免其实施犯罪行为<br />' +
                                              '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                              '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                              '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报<br />' +
                                             ' 使用、维护方便 可以适应各种安装环境<br />' +
                                             ' 能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                              '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '大连二炮部队'
            },
        },
        {
            id: 6,
            name: '监狱',
            data: {
                img: '/Sources/realImgs/solution/6jy.jpg',
                imgDesc: '监狱是关押管理犯罪人员的场所，在押人员多为刑事犯罪分子，关押与管理不容易，安全是首要需保障的问题。即要保障社会的安全，也要保障狱警人员的安全，犯罪分子的安全。监狱的周界防范措施是监狱现代化管理的有力工具。',
                workStatus: '监狱是关押管理犯罪人员的场所，在押人员多为刑事犯罪分子，关押与管理不容易，安全是首要需保障的问题。即要保障社会的安全，也要保障狱警人员的安全，犯罪分子的安全。监狱的周界防范措施是监狱现代化管理的有力工具。',
                workAttr: '监狱周界大，犯人很容易藏匿。<br />' +
                                          '服刑人员皆为危险人员, 心理不容易把握，安全管理难度大。<br />' +
                                          '服刑犯人如果企图逃匿,红外对射无法实现对其的威慑作用,而且无法形成阻挡。',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给服刑人员以极大的心里威慑作用，避免其产生企图逃跑等念头<br />' +
                                          '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                          '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报，适应监狱周界长、巡查不便的特别，可以大大减少保安人员的出警次数<br />' +
                                          '使用、维护方便 可以适应各种安装环境，能很好解决监狱普遍存在的建造时间长、历史问题多、地形复杂复杂的问题<br />' +
                                          '能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                          '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '上海宝山监狱'
            },
        },
        {
            id: 7,
            name: '看守所',
            data: {
                img: '/Sources/realImgs/solution/7kss.jpg',
                imgDesc: '看守所是一个安全性要求特别高的场所，既要求系统运行的稳定，又要求出现警情时在第一时间作出反应。因此架设电子围栏,不仅从周界上防范服刑人员的出逃,而且可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统',
                workStatus: '看守所是一个安全性要求特别高的场所，既要求系统运行的稳定，又要求出现警情时在第一时间作出反应。因此架设电子围栏,不仅从周界上防范服刑人员的出逃,而且可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统',
                workAttr: '看守所一般周界相对监狱较小,但是由于人员的特殊性,所以对安防要求很高.<br />' +
                                          '服刑人员皆为危险人员, 心理不容易把握，安全管理难度大。<br />' +
                                          '服刑犯人如果企图逃匿,红外对射无法实现对其的威慑作用,而且无法形成阻挡.',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给服刑人员以极大的心里威慑作用，避免其产生企图逃跑等念头<br />' +
                                          '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                          '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报，<br />' +
                                         ' 使用、维护方便 可以适应各种安装环境，<br />' +
                                          '能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                         ' 软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '上海张华浜派出所<br />' +
                          '上海崇明建设派出所<br />' +
                                          '上海崇明三星派出所<br />' +
                '上海崇明县横沙派出所 '
            },
        },
        {
            id: 8,
            name: '能源',
            data: {
                img: '/Sources/realImgs/solution/8ny.jpg',
                imgDesc: '石油石化、天然气系统是国家安全防范的重点对象，一旦发生火灾或爆炸等事故，都将造成重大的人员伤亡和国家财产的严重损失。',
                workStatus: '石油石化、天然气系统是国家安全防范的重点对象，一旦发生火灾或爆炸等事故，都将造成重大的人员伤亡和国家财产的严重损失。',
                workAttr: '周界大，入侵者很容易藏匿。<br />' +
                                          '擅闯进容易引发生命安全的危险。<br />' +
                                          '传统红外报警方式，存在漏洞，易被入侵，经常误报，且设计理念落后，与人防难以有效结合。',
                solution: '安防设备：<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '软件：安防平台软件',
                advantage: '安全防护性能高：电子围栏没有明显的火源,因此能避免产生火花,从而避免火灾<br />' +
                                          '具有威慑功能：警示标志给入侵者以极大的心里威慑作用<br />' +
                                          '主动防护性强：有效增加围墙高度，起到很好的主动防护效果<br />' +
                                          '防范严密无死角：可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低：能有效防止小动物、树枝、恶劣天气等造成的误报，<br />' +
                                          '能与安防、IT系统联网：可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                         ' 软件可以实现远程操作：方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '泰兴新奥燃气天燃气储备站<br />' +
                          '安徽池州龙山钼矿<br />' +
                '上海东沟油库'
            },
        },
        {
            id: 9,
            name: '机场',
            data: {
                img: '/Sources/realImgs/solution/9jc.jpg',
                imgDesc: '机场的建设已经越来越多，而且机场一般建设在离市区很远的郊区，且周界较大，很难防范，机场周围人的素质相对于较差，擅自进入机场容易引起生命安全的危险，因此给机场的安防带来了很大的困难。',
                workStatus: '机场的建设已经越来越多，而且机场一般建设在离市区很远的郊区，且周界较大，很难防范，机场周围人的素质相对于较差，擅自进入机场容易引起生命安全的危险，因此给机场的安防带来了很大的困难。',
                workAttr: '机场周界大，入侵者很容易藏匿。<br />' +
                                          '机场处于远离市区的郊区，因此人员素质低，擅闯进机场容易引发生命安全的危险。<br />' +
                                          '传统红外报警方式，存在漏洞，易被入侵，经常误报，且设计理念落后，与人防难以有效结合。',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给犯罪分子以极大的心里威慑作用，避免其实施犯罪行为<br />' +
                                          '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                          '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报.<br />' +
                                          '能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                          '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: ''
            },
        },
        {
            id: 10,
            name: '动植物基地',
            data: {
                img: '/Sources/realImgs/solution/10dzwjd.jpg',
                imgDesc: '随着珍惜名贵的动物的灭绝和植物的日益减少,国家和政府正采取一系列的保护措置来拯救这些珍贵的物品.动植物基地作为国家研究和培育珍贵的动植物的保护基地,越来越受到政府和广大群众的重视.为了有效的避免居心叵测的人的偷盗,安防措施的采取是非常有必要的.',
                workStatus: '随着珍惜名贵的动物的灭绝和植物的日益减少,国家和政府正采取一系列的保护措置来拯救这些珍贵的物品.动植物基地作为国家研究和培育珍贵的动植物的保护基地,越来越受到政府和广大群众的重视.为了有效的避免居心叵测的人的偷盗,安防措施的采取是非常有必要的.',
                workAttr: '基地的周界大,而且绿化非常好，因此偷盗者很容易藏匿。<br />' +
                                          '为有效的照顾好珍贵的动物,因此动物基地里面的动物基本是自由活动的,所以必须采取有效的保护和与游览者的隔离.',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给偷盗者以极大的心里威慑作用，相比红外对射,有了很强的阻挡功能<br />' +
                                          '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                          '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报.<br />' +
                                          '保护的同时能避免对动植物的损害 电子围栏采用的脉冲电压,不会对动植物造成身体上的损伤.<br />' +
                                          '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: ''
            },
        },
        {
            id: 11,
            name: '仓库',
            data: {
                img: '/Sources/realImgs/solution/11ck.jpg',
                imgDesc: '仓库作为存储物质资源的设备，在生产中发挥着重大的作用，具体来说，仓库有以下几种：粮库、油库、军械库、物资库等，这里面存储的有的是关系到国计民生的物资，有的是危险品，有的是军队的重要物资，有的是企业的支柱产品。',
                workStatus: '仓库作为存储物质资源的设备，在生产中发挥着重大的作用，具体来说，仓库有以下几种：粮库、油库、军械库、物资库等，这里面存储的有的是关系到国计民生的物资，有的是危险品，有的是军队的重要物资，有的是企业的支柱产品。<br />' +
                                          '每一个仓库的安全必须要给予充分保障。有的仓库离管理中心距离比较远，有的仓库多而分布比较分散，有的仓库周围地形比较复杂，在这种情况下，有线的监控系统的施工难度很大，经济费用高，容易被破坏。',
                workAttr: '仓库周界大,入侵者容易藏匿.<br />' +
                                          '以下几种情况,需要第一时间报警: 仓库的大门正在被人破坏, 有人试图从窗户里爬进,且显示出现报警的位置.<br />' +
                                          '库区面积较大且库房较多又不规则，同时因各仓库之间的位置也不规则，采用摄像机监控的点位设置不好确定',
                solution: '安防设备：<br />' +
                          '脉冲电子围栏主机+脉冲电子围栏前端+报警主机/智能键盘；<br />' +
                          '张力电子围栏主机+张力电子围栏前端；<br />' +
                          '振动光纤<br />' +
                          '软件：安防平台软件',
                advantage: '具有威慑功能 高压电网和警示标志给犯罪分子以极大的心里威慑作用，避免其实施犯罪行为<br />' +
                                          '主动防护性强 企图跨越时给与电击，起到很好的主动防护效果<br />' +
                                          '防范严密无死角 可以依据地形任意架设，没有死角，消除安全盲点<br />' +
                                          '误报率低 能有效防止小动物、树枝、恶劣天气等造成的误报.<br />' +
                                          '能与安防、IT系统联网 可以与监控联动，当报警时，摄像机转向相应位置开始录像；也能很好的融入IT系统<br />' +
                                          '软件可以实现远程操作，方便管理 从围墙现场到指挥中心距离很长，所以需要远程控制，比如远程开、关机等',
                cases: '保时捷汽车上海仓库<br />' +
                          '新建民爆器材总仓库<br />' +
                          '安徽东至县弹药库'
            },
        }
    ];

    return {
        all: function () {
            return solutionData;
        },
        getSolution: function (solutionId) {
            for (var i = 0; i < solutionData.length; i++) {
                if (solutionData[i].id === parseInt(solutionId)) {
                    return solutionData[i];
                }
            }
            return null;
        }
    };
});
